scarab/advanced.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-11 月 15:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Scarab: Advanced Solving Techniques</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="[[http://kix.istc.kobe-u.ac.jp/~soh/][Takehide Soh]]Takehide Soh" />
<link rel="stylesheet" type="text/css" href="../myhome.css" />
</head>
<body>
<div id="content">
<h1 class="title">Scarab: Advanced Solving Techniques</h1>
<blockquote>
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-6313627-5']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</div>

<table class="menu" border="0" cellspacing="0" cellpadding="20" width="900px">
<tr>
<td class="menu" bgcolor="#3B5998"><a href="index.html">Home</a></td>
<td class="menu" bgcolor="#3B5998"><a href="examples.html">Examples</a></td>
<td class="menu" bgcolor="#3B5998"><a href="doc.html">Documents</a></td>
<td class="menu" bgcolor="#3B5998"><a href="advanced.html">Advanced Usage</a></td>
<td class="menu" bgcolor="#3B5998"><a href="tutorial.html">Tutorial</a></td>
<td class="menu" bgcolor="#3B5998"><a href="apps.html">Apps</a></td>
</tr>
</table>

<div id="content">
</blockquote>
<style type="text/css">
#table1 th { background-color: lightyellow;
     border-style: solid; border-color: black; border-width: thin; }
#table1 td { background-color: #eeeeee;
     border-style: solid; border-color: black; border-width: thin; }
#table1 td+td { background-color: white; }
#table1 td { text-align: left; }
#table1 td+td { text-align: right; }
</style>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Developers can Construct their own SAT-based Systems.</h2>
<div class="outline-text-2" id="text-orgheadline3">
</div><ul class="org-ul"><li><a id="orgheadline1"></a>Since Scarab is designed to be an useful workbench rather than a final product, constraint models and search strategies are intended to be modeled and/or customized to meet developers&rsquo; requirement.<br  /></li>
<li><a id="orgheadline2"></a>This page provides some examples of customizing <b>alldiff constraints</b> and <b>search strategies</b>.<br  /></li></ul>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10">Customizing Alldiff Constraint</h2>
<div class="outline-text-2" id="text-orgheadline10">
</div><ul class="org-ul"><li><a id="orgheadline4"></a>We consider the following 4 models of \(alldiff(x_{1}, x_{2}, \ldots, x_{n})\)<br  /></li>

<li><a id="orgheadline5"></a><b>Alldiff 1</b>: Original Alldiff.<br  /><div class="outline-text-3" id="text-orgheadline5">
<p>
\( \bigwedge_{i < j} (x_{i} \ne x_{j}) \)
</p>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">alldiff</span>(<span style="color: #a0522d;">xs</span>: <span style="color: #228b22;">Seq[Var]</span>) = {
  And(And(<span style="color: #a020f0;">for</span> (Seq(x, y) &lt;- xs.combinations(2)) <span style="color: #a020f0;">yield</span> x !== y))
}
</pre>
</div>
</div></li>
<li><a id="orgheadline6"></a><b>Alldiff 2</b>: Alldiff with Permutaion Constraints<br  /><div class="outline-text-3" id="text-orgheadline6">
<br>
<p>
\(\bigwedge_{i < j} (x_{i} \ne x_{j}) \wedge \bigwedge_{i=lb}^{ub}\left(\bigvee_{j=1}^{n} (x_{j}=i)\right)\)
</p>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">alldiff</span>(<span style="color: #a0522d;">xs</span>: <span style="color: #228b22;">Seq[Var]</span>) = {
  <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">lb</span> = <span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> csp.dom(x).lb 
  <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">ub</span> = <span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> csp.dom(x).ub 
  And(
    And(<span style="color: #a020f0;">for</span> (Seq(x, y) &lt;- xs.combinations(2)) <span style="color: #a020f0;">yield</span> x !== y),
    And(<span style="color: #a020f0;">for</span> (num &lt;- lb.min to ub.max) <span style="color: #a020f0;">yield</span> Or(<span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> x === num))
  )
}
</pre>
</div>
</div></li>

<li><a id="orgheadline7"></a><b>Alldiff 3</b>: Alldiff with Pigeon Hole Constraints<br  /><div class="outline-text-3" id="text-orgheadline7">
<br>
<p>
\(\bigwedge_{i < j} (x_{i} \ne x_{j}) \wedge \neg\bigwedge_{i=1}^{n}(x_{i} < lb + n - 1) \wedge \neg\bigwedge_{i=1}^{n}(x_{i} > ub - n+ 1)\)
</p>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">alldiff</span>(<span style="color: #a0522d;">xs</span>: <span style="color: #228b22;">Seq[Var]</span>) = {
  <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">lb</span> = <span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> csp.dom(x).lb 
  <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">ub</span> = <span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> csp.dom(x).ub 
  And(
    And(<span style="color: #a020f0;">for</span> (Seq(x, y) &lt;- xs.combinations(2)) <span style="color: #a020f0;">yield</span> x !== y),
    Or(<span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> !(x &lt; lb.min+xs.size-1)),
    Or(<span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> !(x &gt; ub.max-xs.size+1))
  )
}
</pre>
</div>
</div></li>
<li><a id="orgheadline8"></a><b>Alldiff 4</b>: Alldiff with Permutation and Pigeon Hole Constraints<br  /><div class="outline-text-3" id="text-orgheadline8">
<br>
<p>
\(\bigwedge_{i < j} (x_{i} \ne x_{j}) \wedge \bigwedge_{i=lb}^{ub}\left(\bigvee_{j=1}^{n} (x_{j}=i)\right) \wedge \neg\bigwedge_{i=1}^{n}(x_{i} < lb + n - 1) \wedge \neg\bigwedge_{i=1}^{n}(x_{i} > ub - n+ 1)\)
</p>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">alldiff</span>(<span style="color: #a0522d;">xs</span>: <span style="color: #228b22;">Seq[Var]</span>) = {
  <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">lb</span> = <span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> csp.dom(x).lb 
  <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">ub</span> = <span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> csp.dom(x).ub 
  And(
    And(<span style="color: #a020f0;">for</span> (Seq(x, y) &lt;- xs.combinations(2)) <span style="color: #a020f0;">yield</span> x !== y),
    And(<span style="color: #a020f0;">for</span> (num &lt;- lb.min to ub.max) <span style="color: #a020f0;">yield</span> Or(<span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> x === num)),
    Or(<span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> !(x &lt; lb.min+xs.size-1)),
    Or(<span style="color: #a020f0;">for</span> (x &lt;- xs) <span style="color: #a020f0;">yield</span> !(x &gt; ub.max-xs.size+1))
  )
}
</pre>
</div>
</div></li>
<li><a id="orgheadline9"></a><b>Experiments on Latin Square</b>: We compared the 4 models with the following Latin Square program. Results are available below.<br  /><div class="outline-text-3" id="text-orgheadline9">
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab._ , dsl._

<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">n</span>: <span style="color: #228b22;">Int </span>= 5
<span style="color: #a020f0;">for</span> (i &lt;- 1 to n; j &lt;- 1 to n)  int('x(i,j),1,n) 
<span style="color: #a020f0;">for</span> (i &lt;- 1 to n) {
  add(alldiff((1 to n).map(j =&gt; 'x(i,j))))
  add(alldiff((1 to n).map(j =&gt; 'x(j,i))))
  add(alldiff((1 to n).map(j =&gt; 'x(j,(i+j-1)%n+1))))
  add(alldiff((1 to n).map(j =&gt; 'x(j,(i+(j-1)*(n-1))%n+1))))}

<span style="color: #a020f0;">if</span> (find)  println(solution)
</pre>
</div>
</div></li></ul>
</div>

<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15">Experimental Results for Latin Square</h2>
<div class="outline-text-2" id="text-orgheadline15">
</div><ul class="org-ul"><li><a id="orgheadline11"></a>We compare the above 4 types of alldiff constraints written in Scarab.<br  /><div class="outline-text-3" id="text-orgheadline11">
<br>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Results for Latin Square of Sizes 7 to 16 (2.93GHz CPU, 3600 sec. T.O.)</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">7</th>
<th scope="col" class="org-right">8</th>
<th scope="col" class="org-right">9</th>
<th scope="col" class="org-right">10</th>
<th scope="col" class="org-right">11</th>
<th scope="col" class="org-right">12</th>
<th scope="col" class="org-left">13</th>
<th scope="col" class="org-right">14</th>
<th scope="col" class="org-right">15</th>
<th scope="col" class="org-right">16</th>
<th scope="col" class="org-right">#Total</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Alldiff 1</td>
<td class="org-right">0.210</td>
<td class="org-right">T.O.</td>
<td class="org-right">T.O.</td>
<td class="org-right">T.O.</td>
<td class="org-right">0.347</td>
<td class="org-right">T.O.</td>
<td class="org-left">T.O.</td>
<td class="org-right">T.O.</td>
<td class="org-right">T.O.</td>
<td class="org-right">T.O.</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Alldiff 2</td>
<td class="org-right">0.232</td>
<td class="org-right">0.245</td>
<td class="org-right">0.230</td>
<td class="org-right">0.391</td>
<td class="org-right">0.317</td>
<td class="org-right">1.150</td>
<td class="org-left">T.O.</td>
<td class="org-right">14.309</td>
<td class="org-right">953.0</td>
<td class="org-right">1303.0</td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-left">Alldiff 3</td>
<td class="org-right">0.265</td>
<td class="org-right">0.306</td>
<td class="org-right">0.219</td>
<td class="org-right">0.332</td>
<td class="org-right">0.252</td>
<td class="org-right">0.885</td>
<td class="org-left">T.O.</td>
<td class="org-right">9.826</td>
<td class="org-right">423.3</td>
<td class="org-right">840.7</td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-left">Alldiff 4</td>
<td class="org-right">0.221</td>
<td class="org-right">0.212</td>
<td class="org-right">0.235</td>
<td class="org-right">0.370</td>
<td class="org-right">0.332</td>
<td class="org-right">0.981</td>
<td class="org-left">0.545</td>
<td class="org-right">9.792</td>
<td class="org-right">389.9</td>
<td class="org-right">458.1</td>
<td class="org-right"><b>10</b></td>
</tr>
</tbody>
</table>

<br>
</div></li>

<li><a id="orgheadline12"></a>The best performance is achieved by Alldiff (4), which has extra permutation and pigeon hole constraints.<br  /></li>
<li><a id="orgheadline13"></a>As is shown in <a href="./examples.html">here</a>, all alldiff constraints are implemented less than 10 lines.<br  /></li>
<li><a id="orgheadline14"></a><b>Implementing your ideas and trials are easy in Scarab!</b><br  /></li></ul>
</div>


<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27">Modeling Search Strategies</h2>
<div class="outline-text-2" id="text-orgheadline27">
</div><ul class="org-ul"><li><a id="orgheadline16"></a>In the following, we provide some examples of how to write search strategies.<br  /></li>
<li><a id="orgheadline17"></a>The first one is decremental search for Square Packing.<br  /><div class="outline-text-3" id="text-orgheadline17">
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab._ , dsl._

<span style="color: #a020f0;">val</span> <span style="color: #a0522d;">n</span> = 15; <span style="color: #a020f0;">val</span> <span style="color: #a0522d;">s</span> =36 

<span style="color: #a020f0;">for</span> (i &lt;- 1 to n)  { int('x(i),0,s-i) ; int('y(i),0,s-i) }
<span style="color: #a020f0;">for</span> (i &lt;- 1 to n; j &lt;- i+1 to n) 
  add(('x(i)+i&lt;='x(j)) || ('x(j)+j&lt;='x(i)) || ('y(i)+i&lt;='y(j)) || ('y(j)+j&lt;='y(i)))

<span style="color: #a020f0;">if</span> (find) println(solution.intMap) 

<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">lb</span> = 15; <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">ub</span> = s; int('m, lb, ub)
<span style="color: #a020f0;">for</span> (i &lt;- 1 to n)
  add(('x(i)+i &lt;= 'm) &amp;&amp; ('y(i)+i &lt;= 'm)) 

<span style="color: #a020f0;">while</span>(lb &lt;= ub &amp;&amp; find('m &lt;= ub)) {
  add('m &lt;= ub); ub -= 1
}

<span style="color: #a020f0;">while</span>(find)  println(solution.intMap)
</pre>
</div>
</div>
<ul class="org-ul"><li><a id="orgheadline18"></a>(Lines 13 to 15) add constraints for optimization<br  /></li>
<li><a id="orgheadline19"></a>(Lines 17 to 19) decremental search<br  /></li>
<li><a id="orgheadline20"></a>(Line 21) enumerate optimal solutions<br  /></li></ul></li>

<li><a id="orgheadline21"></a>Incremental Search<br  /><div class="outline-text-3" id="text-orgheadline21">
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">lb</span> = 15; <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">ub</span> = s; int('m, lb, ub)
<span style="color: #a020f0;">for</span> (i &lt;- 1 to n)
  add(('x(i)+i &lt;= 'm) &amp;&amp; ('y(i)+i &lt;= 'm)) 

<span style="color: #a020f0;">while</span>(lb &lt; ub &amp;&amp; !find('m &lt;= lb)) {
  add('m &gt; lb); lb += 1
}

<span style="color: #a020f0;">while</span>(find)  println(solution.intMap)
</pre>
</div>
</div>
<ul class="org-ul"><li><a id="orgheadline22"></a>(Lines 1 to 3) add constraints for optimization<br  /></li>
<li><a id="orgheadline23"></a>(Lines 5 to 7) decremental search<br  /></li>
<li><a id="orgheadline24"></a>(Line 9) enumerate optimal solutions<br  /></li></ul></li>

<li><a id="orgheadline25"></a>Binary Search<br  /><div class="outline-text-3" id="text-orgheadline25">
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">lb</span> = 5; <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">ub</span> = s
commit
<span style="color: #a020f0;">while</span>(lb &lt; ub) {
  <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">size</span> = (lb + ub) / 2
  <span style="color: #a020f0;">for</span> (i &lt;- 1 to n)
    add(('x(i)+i&lt;=size)&amp;&amp;('y(i)+i&lt;=size))
  <span style="color: #a020f0;">if</span> (find) {
    ub = size; commit;
  } <span style="color: #a020f0;">else</span> {
    lb = size + 1; rollback;
  }
}
</pre>
</div>
</div>
<ul class="org-ul"><li><a id="orgheadline26"></a>(Lines 3 to 12) binary search<br  /></li></ul></li></ul>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="http://kix.istc.kobe-u.ac.jp/~soh/">Takehide Soh</a></p>
<p class="date">Created: 2019-02-11 月 15:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
